---
kind: type
id: T:Autodesk.Revit.DB.Structure.ICodeCheckingParameterServer
source: html/baf73c3d-86c4-7325-2e44-ff12511ae325.htm
---
# Autodesk.Revit.DB.Structure.ICodeCheckingParameterServer

Interface for the code checking parameter server to implement.

## Syntax (C#)
```csharp
public interface ICodeCheckingParameterServer : IExternalServer
```